app/controllers/departments_controller.rb

  def find_department
    @department = Department.find_by id: params[:id]
---
SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 100 LIMIT 1