app/controllers/reports_controller.rb

SELECT `relationships`.* FROM `relationships` WHERE `relationships`.`department_id` = 100 AND `relationships`.`user_id` = 101 LIMIT 1
SELECT `reports`.* FROM `reports` WHERE `reports`.`from_user_id` = 101
---
  def index
    @relationship = Relationship.find_by department_id: params[:department_id], user_id: current_user.id
    if @relationship&.manager? || current_user.admin?
      @reports = Report.where :department_id => params[:department_id]
    else
      @reports = Report.where from_user_id: current_user.id

SELECT `reports`.* FROM `reports` WHERE `reports`.`id` = 1 LIMIT 1
---
  def show
    @report = Report.find_by id: params[:id]

SELECT `reports`.* FROM `reports` WHERE `reports`.`id` = 1 LIMIT 1
---
  def edit
    @report = Report.find_by id: params[:id]

SELECT `reports`.* FROM `reports` WHERE `reports`.`id` = 1 LIMIT 1
UPDATE `reports` SET `reports`.`today_plan` = 'Today plan edit', `reports`.`today_work` = 'Today work edit', `reports`.`today_problem` = 'Today problem edit', `reports`.`tomorow_plan` = 'Tomorow plan edit', `reports`.`updated_at` = '2022-07-23 08:39:03.963339' WHERE `reports`.`id` = 1
---
  def update
    @report = Report.find_by id: params[:id]
    if @report.update(report_params)

SELECT `reports`.* FROM `reports` WHERE `reports`.`id` = 1 LIMIT 1
DELETE FROM `reports` WHERE `reports`.`id` = 1
---
  def destroy
    @report = Report.find_by id: params[:id]
    if @report.destroy

SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 100 LIMIT 1
---
  def find_department
    @department = Department.find_by id: params[:department_id]

SELECT `relationships`.* FROM `relationships` WHERE `relationships`.`department_id` = 100 AND `relationships`.`role_type` = 1
---
  def find_manager
    @managers = Relationship.where department_id: @department.id,
                                   role_type: :manager